@extends('layouts.main.main')

@section('page.title', __('Условия использования'))

@push('css')
    <link rel="stylesheet" type="text/css" href="{{ asset('css/faq/include.css') }}" />
@endpush

@section('main.content')
    <div class="row gx-3">
        <div class="col-3 p-3">
            <x-page.title-anchor :list-number=true />
        </div>
        <div class="col-7 p-3">
            <h1>
                {{ __('Условия использования') }}
            </h1>
            <p>
                {{ __('Настоящий документ «Пользовательское соглашение» представляет собой предложение «Аквариум» (далее – «Администрация»), заключить договор на изложенных ниже условиях Соглашения.') }}
            </p>
            <h2>1. {{ __('Общие положения Пользовательского соглашения') }}</h2>
            <p>
                1.1.
                {{ __('В настоящем документе и вытекающих или связанным с ним отношениях Сторон применяются следующие термины и определения:') }}
            </p>
            <ul>
                <li>{{ __('Платформа – программно-аппаратные средства, интегрированные с Сайтом Администрации;') }}</li>
                <li>{{ __('Пользователь – дееспособное физическое лицо, присоединившееся к настоящему Соглашению в собственном интересе либо выступающее от имени и в интересах представляемого им юридического лица;') }}
                </li>
                <li>{{ __('Сайт Администрации / Сайт – интернет-сайты, размещенные в домене aquariumsocial.ru и его поддоменах;') }}
                </li>
                <li>{{ __('Сервис – комплекс услуг и лицензия, предоставляемые Пользователю с использованием Платформы;') }}
                </li>
                <li>{{ __('Соглашение – настоящее соглашение со всеми дополнениями и изменениями.') }}</li>
            </ul>
            <p>
                1.2.
                {{ __('Использование вами Сервиса любым способом и в любой форме в пределах его объявленных функциональных возможностей, включая:') }}
            </p>
            <ul>
                <li>{{ __('просмотр размещенных на Сайте материалов;') }}</li>
                <li>{{ __('регистрация и/или авторизация на Сайте;') }}</li>
                <li>{{ __('размещение или отображение на Сайте любых материалов, включая но не ограничиваясь такими как: тексты, гипертекстовые ссылки, изображения, аудио и видео- файлы, сведения и/или иная информация.') }}
                </li>
            </ul>
            <p>
                {{ __('Создает договор на условиях настоящего Соглашения в соответствии с положениями ст.437 и 438 Гражданского кодекса Российской Федерации.') }}
            </p>
            <p>
                1.3.
                {{ __('Воспользовавшись любой из указанных выше возможностей по использованию Сервиса вы подтверждаете, что:') }}
            </p>
            <ul>
                <li>{{ __('ознакомились с условиями настоящего Соглашения в полном объеме до начала использования Сервиса;') }}
                </li>
                <li>{{ __('принимаете все условия настоящего Соглашения в полном объеме без каких-либо изъятий и ограничений с вашей стороны и обязуетесь их соблюдать или прекратить использование Сервиса. Если вы не согласны с условиями настоящего Соглашения или не имеете права на заключение договора на их основе, вам следует незамедлительно прекратить любое использование Сервиса;') }}
                </li>
                <li>{{ __('соглашение (в том числе любая из его частей) может быть изменено Администрацией без какого-либо специального уведомления. Новая редакция Соглашения вступает в силу с момента её размещения на Сайте Администрации либо доведения до сведения Пользователя в иной удобной форме, если иное не предусмотрено новой редакцией Соглашения.') }}
                </li>
            </ul>
            <h2>2. {{ __('Общие условия пользования Сервисом') }}</h2>
            <p>
                2.1.
                {{ __('Использование функциональных возможностей Сервиса допускается только после прохождения Пользователем регистрации и авторизации на Сайте в соответствии с установленной Администрацией процедурой.') }}
            </p>
            <p>
                2.2.
                {{ __('Технические, организационные и коммерческие условия использования Сервиса, в том числе его функциональных возможностей доводятся до сведения Пользователей путем отдельного размещения на Сайте или путем нотификации Пользователей.') }}
            </p>
            <p>
                2.3.
                {{ __('Выбранные Пользователем логин и пароль являются необходимой и достаточной информацией для доступа Пользователя на Сайт. Пользователь не имеет права передавать свои логин и пароль третьим лицам, несет полную ответственность за их сохранность, самостоятельно выбирает способ их хранения.') }}
            </p>
        </div>
    </div>

    <x-button-top />
@endsection

@push('js')
    <script src="{{ asset('js/page/left-bar-anchors.js') }}"></script>
@endpush
