@extends('layouts.main.main')

@section('page.title', __('API'))

@push('css')
    <link rel="stylesheet" type="text/css" href="{{ asset('css/faq/include.css') }}" />
@endpush

@section('main.content')
    <div class="row gx-3">
        <div class="col-3 p-3">
            <x-page.title-anchor />
        </div>
        <div class="col-7 p-3">
            <h1>{{ __('API') }}</h1>
            <p class="fs-5">
                {{ __('Интерфейс API – универсальное средство взаимодействия с социальной сетью Аквариум.') }}
            </p>
            <h2>
                {{ __('Введение') }}
            </h2>
            <p>
                {{ __('Интерфейс API (Application Programming Interface) – это набор функций, методов, протоколов и инструментов, предоставляемых социальной сетью Аквариум, который позволяет разработчикам создавать свои приложения, взаимодействовать с данными и функциональностью Аквариума, расширять возможности социальной сети и интегрировать ее с другими приложениями и сервисами.') }}
            </p>
            <h2>
                {{ __('Зачем нужен интерфейс API?') }}
            </h2>
            <p>
                {{ __('Интерфейс API предоставляет разработчикам возможность использовать функциональные возможности Аквариума в своих приложениях и сервисах. Он позволяет получать доступ к профилям пользователей, публикациям, друзьям, сообщениям и другим данным, а также выполнять различные действия, такие как создание и редактирование записей, управление контактами, отправка уведомлений и т.д.') }}
            </p>
            <p>
                {{ __('Используя интерфейс API, разработчики могут создавать приложения, интегрированные с Аквариумом, расширяя возможности социальной сети и обеспечивая более гибкое и персонализированное взаимодействие для пользователей.') }}
            </p>
            <h2>
                {{ __('Запросы к API и обработка данных') }}
            </h2>
            <p>
                {{ __('Для получения данных из API Аквариума следует направлять запросы по URL, в некоторых из которых могут фигурировать данные для уточнения запроса и получения более точной информации о пользователях.') }}
            </p>

            <h2>
                {{ __('Схема данных') }}
            </h2>
            <h3>
                {{ __('Получение данных о пользователях') }}
            </h3>
            <p>
                {{ __('Для получения данных о пользователях следует выполнить следующие запросы:') }}
            </p>
            <table class="table table-hover">
                <thead>
                    <tr>
                        <th scope="col">URL</th>
                        <th scope="col">{{ __('Значение') }}</th>
                    </tr>
                </thead>
                <tbody>
                    <tr>
                        <td>{{ env('APP_URL') }}/api/users</td>
                        <td>{{ __('Все пользователи') }}</td>
                    </tr>
                    <tr>
                        <td>{{ env('APP_URL') }}/api/user/id/{id}</td>
                        <td>{{ __('Пользователь по ID') }}</td>
                    </tr>
                    <tr>
                        <td>{{ env('APP_URL') }}/api/user/{username}</td>
                        <td>{{ __('Пользователь по username') }}</td>
                    </tr>
                </tbody>
            </table>
            <p>
                {{ __('При ошибке в запросе или отсутствии пользователя, ответом будет пустой JSON-объект. Получить информацию можно только о пользователе с подтвержденным аккаунтом.') }}
            </p>
            <h4>
                {{ __('Схема данных, получаемых о пользователях') }}
            </h4>
            <table class="table table-hover">
                <thead>
                    <tr>
                        <th scope="col">{{ __('Название поля') }}</th>
                        <th scope="col">{{ __('Значение') }}</th>
                        <th scope="col">{{ __('Тип данных') }}</th>
                    </tr>
                </thead>
                <tbody>
                    <tr>
                        <td>id</td>
                        <td>{{ __('Номер пользователя') }}</td>
                        <td>integer</td>
                    </tr>
                    <tr>
                        <td>username</td>
                        <td>{{ __('Имя пользователя') }}</td>
                        <td>string</td>
                    </tr>
                    <tr>
                        <td>firstName</td>
                        <td>{{ __('Имя') }}</td>
                        <td>string</td>
                    </tr>
                    <tr>
                        <td>lastName</td>
                        <td>{{ __('Фамилия') }}</td>
                        <td>string</td>
                    </tr>
                    <tr>
                        <td>avatar</td>
                        <td>{{ __('Главное изображение') }}</td>
                        <td>string</td>
                    </tr>
                    <tr>
                        <td>cap</td>
                        <td>{{ __('Изображение на фоне') }}</td>
                        <td>string</td>
                    </tr>
                    <tr>
                        <td>desc</td>
                        <td>{{ __('Описание') }}</td>
                        <td>string</td>
                    </tr>
                    <tr>
                        <td>sub</td>
                        <td>{{ __('Количество подписок') }}</td>
                        <td>integer</td>
                    </tr>
                    <tr>
                        <td>subs</td>
                        <td>{{ __('Количество подписчиков') }}</td>
                        <td>integer</td>
                    </tr>
                    <tr>
                        <td>achivs</td>
                        <td>{{ __('Количество достижений') }}</td>
                        <td>integer</td>
                    </tr>
                </tbody>
            </table>
            <h3>{{ __('Хранение изображений') }}</h3>
            <h4>{{ __('Главное изображение') }}</h4>
            <p>
                {{ __('Главное изображение представляет собой название изображения или ссылку на изображение. В случае использования главного изображения по умолчанию, в качестве значения будет храниться MAN или WOMAN, а затем номер изображения. Если было загружено собственное главное изображение, тогда в качестве значения будет храниться URL к изображению.') }}
            </p>
            <p>
                {{ __('Для того, чтобы получить ссылку на главное изображение по умолчанию, следует использовать URL:') }}
            </p>
            <p>
                {{ env('APP_URL') }}/img/user/logo/$avatar.jpg
            </p>
            <p>
                {{ __('Где в качестве $avatar следует использовать значение поля.') }}
            </p>
            <h4>{{ __('Фоновое изображение') }}</h4>
            <p>
                {{ __('Ситуация с фоновым изображением аналогичная, если использовать фоновое изображение по умолчанию, в качестве значения будет храниться имя BG и номер изображения. Если было загружено собственное фоновое изображение, тогда следует использовать ссылку:') }}
            </p>
            <p>
                {{ env('APP_URL') }}/img/user/bg/$bg.jpg
            </p>
            <p>
                {{ __('Где в качестве $bg следует использовать значение поля.') }}
            </p>
            <h3>
                {{ __('Получение данных о записях') }}
            </h3>
            <p>
                {{ __('Запросы для получения записей: ') }}
            </p>
            <table class="table table-hover">
                <thead>
                    <tr>
                        <th scope="col">URL</th>
                        <th scope="col">{{ __('Значение') }}</th>
                    </tr>
                </thead>
                <tbody>
                    <tr>
                        <td>{{ env('APP_URL') }}/api/posts</td>
                        <td>{{ __('Все записи') }}</td>
                    </tr>
                    <tr>
                        <td>{{ env('APP_URL') }}/api/posts/{id}</td>
                        <td>{{ __('Записи пользователя по ID') }}</td>
                    </tr>
                    <tr>
                        <td>{{ env('APP_URL') }}/api/post/{id}/{idPost}</td>
                        <td>{{ __('Запись с IDPOST у пользователя с ID') }}</td>
                    </tr>
                </tbody>
            </table>
            <h4>
                {{ __('Схема данных, получаемых о записях') }}
            </h4>
            <table class="table table-hover">
                <thead>
                    <tr>
                        <th scope="col">{{ __('Название поля') }}</th>
                        <th scope="col">{{ __('Значение') }}</th>
                        <th scope="col">{{ __('Тип данных') }}</th>
                    </tr>
                </thead>
                <tbody>
                    <tr>
                        <td>idPost</td>
                        <td>{{ __('Номер поста у пользователя') }}</td>
                        <td>integer</td>
                    </tr>
                    <tr>
                        <td>idUser</td>
                        <td>{{ __('Номер пользователя') }}</td>
                        <td>string</td>
                    </tr>
                    <tr>
                        <td>haveimage</td>
                        <td>{{ __('Есть ли изображение') }}</td>
                        <td>boolean</td>
                    </tr>
                    <tr>
                        <td>imagename</td>
                        <td>{{ __('Путь к изображению') }}</td>
                        <td>string</td>
                    </tr>
                    <tr>
                        <td>message</td>
                        <td>{{ __('Содержимое записи') }}</td>
                        <td>text</td>
                    </tr>
                    <tr>
                        <td>desc</td>
                        <td>{{ __('Отрывок из записи (описание)') }}</td>
                        <td>string</td>
                    </tr>
                </tbody>
            </table>
        </div>
    </div>

    <x-button-top />
@endsection

@push('js')
    <script src="{{ asset('js/page/left-bar-anchors.js') }}"></script>
@endpush
